micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_eth_ex.c
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_eth_ex.c
  * @author  MCD Application Team
  * @brief   ETH HAL Extended module driver.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

#ifdef HAL_ETH_MODULE_ENABLED

#if defined(ETH1)

/** @defgroup ETHEx ETHEx
  * @brief ETH HAL Extended module driver
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup ETHEx_Private_Constants ETHEx Private Constants
  * @{
  */
#define ETH_MACL4CR_MASK     (ETH_MACL3L4C0R_L4PEN0 | ETH_MACL3L4C0R_L4SPM0 | \
                              ETH_MACL3L4C0R_L4SPIM0 | ETH_MACL3L4C0R_L4DPM0 | \
                              ETH_MACL3L4C0R_L4DPIM0)

#define ETH_MACL3CR_MASK     (ETH_MACL3L4C0R_L3PEN0 | ETH_MACL3L4C0R_L3SAM0 | \
                              ETH_MACL3L4C0R_L3SAIM0 | ETH_MACL3L4C0R_L3DAM0 | \
                              ETH_MACL3L4C0R_L3DAIM0 | ETH_MACL3L4C0R_L3HSBM0 | \
                              ETH_MACL3L4C0R_L3HDBM0)


#define ETH_MACRXVLAN_MASK (ETH_MACVTCR_EIVLRXS | ETH_MACVTCR_EIVLS | \
                            ETH_MACVTCR_ERIVLT | ETH_MACVTCR_EDVLP | \
                            ETH_MACVTCR_VTHM | ETH_MACVTCR_EVLRXS | \
                            ETH_MACVTCR_EVLS | ETH_MACVTCR_DOVLTC | \
                            ETH_MACVTCR_ERSVLM | ETH_MACVTCR_ESVL | \
                            ETH_MACVTCR_VTIM | ETH_MACVTCR_ETV)

#define ETH_MACTXVLAN_MASK (ETH_MACVIR_VLTI | ETH_MACVIR_CSVL | \
                            ETH_MACVIR_VLP | ETH_MACVIR_VLC)

#define ETH_MACRXQC1R_MASK            0x37F77877U
#define ETH_MACRXQCR_MASK             0x00030303U
#define ETH_MTLOMR_MASK               0x00000366U
#define ETH_MTLTXQxOMR_MASK           0x000F007FU
#define ETH_MTLRXQxOMR_MASK           0x00F1C7FBU
#define ETH_MACRXQC2R_PSRQ_MASK       0x0000FFFFU
#define ETH_MAC_TMRQR_MASK            0x0017FFFFU
#define ETH_MAC_IACR_MASK             0x0000FF03U

#define ETH_OP_BUSY_TIMEOUT           0x000000FFU

#define ETH_MAC_L4_SRSP_MASK          0x0000FFFFU
#define ETH_MAC_L4_DSTP_MASK          0xFFFF0000U
#ifdef HAL_ETH_USE_TAS
#define ETH_MTLESTCR_MASK             0xFFFFF7F2U
/* Maximum Width of the time interval in Gate Control List */
#define ETH_EST_WID_MAX               (24U)
/* Maximum depth of Gate Control List */
#define ETH_EST_DEP_MAX               (64U)
#endif /* HAL_ETH_USE_TAS */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions ---------------------------------------------------------*/
/** @defgroup ETHEx_Exported_Functions ETH Extended Exported Functions
  * @{
  */

/** @defgroup ETHEx_Exported_Functions_Group1 Extended features functions
  * @brief    Extended features functions
  *
@verbatim
 ===============================================================================
                      ##### Extended features functions #####
 ===============================================================================
    [..] This section provides functions allowing to:
      (+) Configure ARP offload module
      (+) Configure L3 and L4 filters
      (+) Configure Extended VLAN features
      (+) Configure Energy Efficient Ethernet module
      (+) Configure the Ethernet MTL after ETH peripheral initialization
      (+) HAL_ETHEx_GetMTLConfig(): Get MTL actual configuration into ETH_MTLConfigTypeDef
      (+) HAL_ETHEx_SetMTLConfig(): Set MTL configuration based on ETH_MTLConfigTypeDef
      (+) HAL_ETHEx_SetMACMTLMappingConfig(): Set MAC MTL Mapping configuration based on ETH_MACMTLMappingTypeDef
      (+) HAL_ETHEx_GetMACMTLMappingConfig(): Get MAC MTL Mapping configuration based on ETH_MACMTLMappingTypeDef
      (+) HAL_ETHEx_SetUserTagPriorityQueue(): Set User Tag Priority Queue
      (+) HAL_ETHEx_GetUserTagPriorityQueue(): Get User Tag Priority Queue
      (+) HAL_ETHEx_SetPacketTypeQueue() : Set Packet Type Queueing
      (+) HAL_ETHEx_GetPacketTypeQueue() : Get Packet Type Queueing
      (+) HAL_ETHEx_EnableCBS() : Enable Qav "Credit Based Sahper" feature
      (+) HAL_ETHEx_SetCBSConfig() : Set Credit Based Shaper parameters
      (+) HAL_ETHEx_GetCBSConfig() : Get Credit Based Shaper parameters
      (+) HAL_ETHEx_GetGCLDepth() : Get the GCL List depth
      (+) HAL_ETHEx_GetGCLWidthTimeInterval() : Get the GCL Width Time interval
      (+) HAL_ETHEx_EnableEST() : Enable Qbv feature
      (+) HAL_ETHEx_DisableEST() : Disable Qbv "Enhancement Scheduled Traffic" feature
      (+) HAL_ETHEx_SetESTConfig() : Set Qbv parameters
      (+) HAL_ETHEx_SetGCLRegisters() : Set Gate Control List registers
      (+) HAL_ETHEx_SetGCLConfig() : Set Gate Control List configuration
      (+) HAL_ETHEx_GetGCLRegisters() : Get Gate Control List configuration
      (+) HAL_ETHEx_EnableFPE() : Enable Qbu "Frame Preemption" feature
      (+) HAL_ETHEx_DisableFPE() : Disable Qbu "Frame Preemption" feature
      (+) HAL_ETHEx_GetFPEConfig() : Get Frame Preemption configuration
      (+) HAL_ETHEx_SetFPEConfig() : Set Frame Preemption configuration

@endverbatim
  * @{
  */

/**
  * @brief  Enables ARP Offload.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */

void HAL_ETHEx_EnableARPOffload(ETH_HandleTypeDef *heth)
{
  SET_BIT(heth->Instance->MACCR, ETH_MACCR_ARP);
}

/**
  * @brief  Disables ARP Offload.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
void HAL_ETHEx_DisableARPOffload(ETH_HandleTypeDef *heth)
{
  CLEAR_BIT(heth->Instance->MACCR, ETH_MACCR_ARP);
}

/**
  * @brief  Set the ARP Match IP address
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  IpAddress: IP Address to be matched for incoming ARP requests
  * @retval None
  */
void HAL_ETHEx_SetARPAddressMatch(ETH_HandleTypeDef *heth, uint32_t IpAddress)
{
  WRITE_REG(heth->Instance->MACARPAR, IpAddress);
}

/**
  * @brief  Configures the L4 Filter, this function allow to:
  *         set the layer 4 protocol to be matched (TCP or UDP)
  *         enable/disable L4 source/destination port perfect/inverse match.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  Filter: L4 filter to configured, this parameter must be one of the following
  *           ETH_L4_FILTER_0
  *           ETH_L4_FILTER_1
  * @param  pL4FilterConfig: pointer to a ETH_L4FilterConfigTypeDef structure
  *         that contains L4 filter configuration.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_SetL4FilterConfig(ETH_HandleTypeDef *heth, uint32_t Filter,
                                              const ETH_L4FilterConfigTypeDef *pL4FilterConfig)
{
  if (pL4FilterConfig == NULL)
  {
    return HAL_ERROR;
  }

  if (Filter == ETH_L4_FILTER_0)
  {
    /* Write configuration to MACL3L4C0R register */
    MODIFY_REG(heth->Instance->MACL3L4C0R, ETH_MACL4CR_MASK, (pL4FilterConfig->Protocol |
                                                              pL4FilterConfig->SrcPortFilterMatch |
                                                              pL4FilterConfig->DestPortFilterMatch));

    /* Write configuration to MACL4A0R register */
    WRITE_REG(heth->Instance->MACL4A0R, (pL4FilterConfig->SourcePort | (pL4FilterConfig->DestinationPort << 16)));

