micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_eth_ex.c
  if (HAL_ETHEx_GetUserTagPriorityQueue(heth, &(macmtlconf->PrioritiesSelectedRxQ0), ETH_RX_QUEUE0) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (HAL_ETHEx_GetUserTagPriorityQueue(heth, &(macmtlconf->PrioritiesSelectedRxQ1), ETH_RX_QUEUE1) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

HAL_StatusTypeDef ETHEx_SetMACMTLMappingConfig(ETH_HandleTypeDef *heth, const ETH_MACMTLMappingTypeDef *macmtlconf)
{
  uint32_t macmtlregval;

  /*------------------------ MACRXQC1R Configuration --------------------*/
  macmtlregval = ((uint32_t)(macmtlconf->AVUntaggedControlPacketsQueue) |
                  ((uint32_t)(macmtlconf->PTPPacketsQueue) << 4)         |
                  ((uint32_t)(macmtlconf->UntaggedPacketQueue) << 12)    |
                  ((uint32_t)(macmtlconf->MulticastBroadcastQueue) << 16) |
                  ((uint32_t)((macmtlconf->MulticastBroadcastQueueEnable == DISABLE) ? 0U : 1U) << 20) |
                  ((uint32_t)((macmtlconf->TaggedAVControlPacketsQueuingEnable == DISABLE) ? 0U : 1U) << 21) |
                  (uint32_t)(macmtlconf->TaggedPTPoEPacketsQueuingControl) |
                  (uint32_t)(macmtlconf->FramePreemptionResidueQueue) |
                  (uint32_t)(macmtlconf->OverridingMCBCQueuePrioritySelect) |
                  ((uint32_t)((macmtlconf->TypeFieldBasedRxQueuingEnable == DISABLE) ? 0U : 1U) << 29));

  /* Write to MACRXQC1R */
  MODIFY_REG(heth->Instance->MACRXQC1R, ETH_MACRXQC1R_MASK, macmtlregval);

  /*------------------------ MACRXQC2R Configuration --------------------*/
  /* Write to MACRXQC2R */
  if (HAL_ETHEx_SetUserTagPriorityQueue(heth, macmtlconf->PrioritiesSelectedRxQ0, ETH_RX_QUEUE0) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (HAL_ETHEx_SetUserTagPriorityQueue(heth, macmtlconf->PrioritiesSelectedRxQ1, ETH_RX_QUEUE1) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /*------------------------ MACRXQCR Configuration --------------------*/
  macmtlregval = (((uint32_t)((macmtlconf->UnicastAddrFilterFailPacketsQueuingEnable == DISABLE) ? 0U : 1U)) |
                  ((uint32_t)(macmtlconf->UnicastAddrFilterFailPacketsQueue) << 1)         |
                  ((uint32_t)((macmtlconf->MulticastAddrFilterFailPacketsQueuingEnable == DISABLE) ? 0U : 1U) << 8) |
                  ((uint32_t)(macmtlconf->MulticastAddFilterFailPacketsQueue) << 9)         |
                  ((uint32_t)((macmtlconf->VLANTagFilterFailPacketsQueuingEnable == DISABLE) ? 0U : 1U) << 16) |
                  ((uint32_t)(macmtlconf->VLANTagFilterFailPacketsQueue) << 17));

  /* Write to MACRXQCR */
  MODIFY_REG(heth->Instance->MACRXQCR, ETH_MACRXQCR_MASK, macmtlregval);

  return HAL_OK;
}

/**
  * @brief  Set the MAC MTL Mapping configuration.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  macmtlconf: pointer to a ETH_MACMTLMappingTypeDef structure that contains
  *         the configuration of the MAC MTL mapping.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_SetMACMTLMappingConfig(ETH_HandleTypeDef *heth, const ETH_MACMTLMappingTypeDef *macmtlconf)
{
  if (macmtlconf == NULL)
  {
    return HAL_ERROR;
  }

  if (heth->gState == HAL_ETH_STATE_READY)
  {
    if (ETHEx_SetMACMTLMappingConfig(heth, macmtlconf) != HAL_OK)
    {
      return HAL_ERROR;
    }

    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}


void ETHEx_SetMTLConfig(ETH_HandleTypeDef *heth, const ETH_MTLConfigTypeDef *mtlconf)
{
  uint32_t queue;
  uint32_t mtlregval;

  /*------------------------ MTLOMR Configuration --------------------*/
  mtlregval = (mtlconf->TxSchedulingAlgorithm) |
              (mtlconf->ReceiveArbitrationAlgorithm) |
              ((uint32_t)((mtlconf->TransmitStatus == DISABLE) ? 1U : 0U) << 1);

  /* Write to MTLOMR */
  MODIFY_REG(heth->Instance->MTLOMR, ETH_MTLOMR_MASK, mtlregval);

  /*------------------------ MTLRXQDMAMR Configuration --------------------*/
  mtlregval = (mtlconf->RxQ[0]).MappedToDMACh |
              (mtlconf->RxQ[1]).MappedToDMACh;

  /* Write to MTLRXQDMAMR */
  MODIFY_REG(heth->Instance->MTLRXQDMAMR, ETH_MTLRXQDMAMR_Q0MDMACH_Msk | ETH_MTLRXQDMAMR_Q1MDMACH_Msk, mtlregval);

  /*------------------------ MTLTXQOMR Configuration --------------------*/
  for (queue = 0; queue < ETH_MTL_TX_Q_CNT; queue++)
  {
    mtlregval = ((mtlconf->TxQ[queue]).QueueOpMode)         |
                ((mtlconf->TxQ[queue]).TransmitQueueMode) |
                ((mtlconf->TxQ[queue]).TxQueueSize);

    /* Write to MTLTXQ0OMR */
    MODIFY_REG(heth->Instance->MTL_QUEUE[queue].MTLTXQOMR, ETH_MTLTXQxOMR_MASK, mtlregval);
  }

  /*------------------------ MACRXQC0R Configuration --------------------*/
  mtlregval = (((mtlconf->RxQ[0]).QueueOpMode)  |
               ((mtlconf->RxQ[1]).QueueOpMode));

  /* Write to MACRXQC0R */
  MODIFY_REG(heth->Instance->MACRXQC0R, ETH_MACRXQC0R_RXQ1EN_Msk | ETH_MACRXQC0R_RXQ0EN_Msk, mtlregval);

  /*------------------------ MTLRXQOMR Configuration --------------------*/
  for (queue = 0; queue < ETH_MTL_RX_Q_CNT; queue++)
  {

    mtlregval = (((mtlconf->RxQ[queue]).ReceiveQueueMode)  |
                 ((mtlconf->RxQ[queue]).RxQueueSize)       |
                 ((uint32_t)(((mtlconf->RxQ[queue]).DropTCPIPChecksumErrorPacket == DISABLE) ? 1U : 0U) << 6) |
                 ((uint32_t)(mtlconf->RxQ[queue]).ForwardRxErrorPacket << 4) |
                 ((uint32_t)(mtlconf->RxQ[queue]).ForwardRxUndersizedGoodPacket << 3));

    /* Write to MTLRXQOMR */
    MODIFY_REG(heth->Instance->MTL_QUEUE[queue].MTLRXQOMR, ETH_MTLRXQxOMR_MASK, mtlregval);
  }
  /*------------------------ MTLTXQ1ECR Configuration --------------------*/
  mtlregval = ((mtlconf->TxQ[1]).AVAlgorithm);

  /* Write to MTLTXQ1ECR */
  MODIFY_REG(heth->Instance->MTL_QUEUE[1].MTLTXQ1ECR, ETH_MTLTXQ1ECR_AVALG_Msk, mtlregval);
}

/**
  * @brief  Set the MTL configuration.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  mtlconf: pointer to a ETH_MTLConfigTypeDef structure that contains
  *         the configuration of the MAC.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_SetMTLConfig(ETH_HandleTypeDef *heth,  ETH_MTLConfigTypeDef *mtlconf)
{
  if (mtlconf == NULL)
  {
    return HAL_ERROR;
  }

  if (heth->gState == HAL_ETH_STATE_READY)
  {
    ETHEx_SetMTLConfig(heth, mtlconf);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Get the User Tag Priority Queueing.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  psrq: user priority
  * @param  queue: queue index
  * @retval None
  */
HAL_StatusTypeDef HAL_ETHEx_GetUserTagPriorityQueue(const ETH_HandleTypeDef *heth, uint32_t *psrq, uint32_t queue)
{
  if (psrq == NULL)
  {
    return HAL_ERROR;
  }

  if (queue == ETH_RX_QUEUE0)
  {
    *psrq = (uint32_t)(READ_BIT(heth->Instance->MACRXQC2R, ETH_MACRXQC2R_PSRQ0) >> ETH_MACRXQC2R_PSRQ0_Pos);
    return HAL_OK;
  }

