micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_eth_ex.c
  if (queue == ETH_RX_QUEUE1)
  {
    *psrq = (uint32_t)(READ_BIT(heth->Instance->MACRXQC2R, ETH_MACRXQC2R_PSRQ1) >> ETH_MACRXQC2R_PSRQ1_Pos);
    return HAL_OK;
  }

  return HAL_ERROR;
}

/**
  * @brief  Set the User Tag Priority Queueing.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  psrq: user priority
  * @param  queue: queue index
  * @retval None
  */
HAL_StatusTypeDef HAL_ETHEx_SetUserTagPriorityQueue(ETH_HandleTypeDef *heth, uint32_t psrq, uint32_t queue)
{
  uint32_t idx;
  uint32_t tmppsrq;
  uint32_t pos;

  for (idx = 0; idx < ETH_MTL_RX_Q_CNT; idx++)
  {
    pos = idx * 8U;

    if (idx != queue)
    {
      /* Ensure that the same priority PSR is not mapped to multiple Rx queues. */
      if (HAL_ETHEx_GetUserTagPriorityQueue(heth, &tmppsrq, idx) != HAL_OK)
      {
        return HAL_ERROR;
      }

      if ((tmppsrq & psrq) != 0U)
      {
        CLEAR_BIT(heth->Instance->MACRXQC2R, (psrq << (queue * 8U)));
        /* PSR is already mapped to another queue */
        return HAL_ERROR;
      }
    }
    else
    {
      MODIFY_REG(heth->Instance->MACRXQC2R, (psrq << pos), (uint32_t)(psrq << pos));
    }
  }
  return HAL_OK;
}

/**
  * @brief  Set the Packet Type Queueing.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  typequeueconf: pointer to a ETH_PacketTypeQueueConfigTypeDef structure that contains
  *         the configuration of the MAC.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_SetPacketTypeQueue(ETH_HandleTypeDef *heth,
                                               const ETH_PacketTypeQueueConfigTypeDef *typequeueconf)
{
  uint32_t cmd;
  uint32_t config;

  if (typequeueconf == NULL)
  {
    return HAL_ERROR;
  }

  if (heth->gState != HAL_ETH_STATE_STARTED)
  {
    return HAL_ERROR;
  }

  cmd = ETH_WRITE_OPERATION | ETH_MACIACR_OB | ((uint32_t)(typequeueconf->Address) << 8);
  config = typequeueconf->Preemption | (typequeueconf->Queue << 16) | typequeueconf->Type;

  /* Enable Type field based Rx queuing */
  SET_BIT(heth->Instance->MACRXQC1R, ETH_MACRXQC1R_TBRQE);

  /* Set configuration to MACTMRQR */
  WRITE_REG(heth->Instance->MACTMRQR, config);

  /* Set command to MACIACR */
  MODIFY_REG(heth->Instance->MACIACR, ETH_MAC_IACR_MASK, cmd);

  /* Get tick */
  uint32_t tickstart = HAL_GetTick();

  /* wait until the Operation reset is done */
  while (READ_BIT(heth->Instance->MACIACR, ETH_MACIACR_OB) != (uint32_t)RESET)
  {
    if ((HAL_GetTick() - tickstart) > ETH_OP_BUSY_TIMEOUT)
    {
      /* Set Error Code */
      heth->MACErrorCode = HAL_ETH_ERROR_TIMEOUT;
      /* Set State as Error */
      heth->gState = HAL_ETH_STATE_ERROR;
      /* Return Error */
      return HAL_ERROR;
    }
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Get the Packet Type Queueing.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  typequeueconf: pointer to a ETH_PacketTypeQueueConfigTypeDef structure that contains
  *         the configuration of the MAC.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_GetPacketTypeQueue(ETH_HandleTypeDef *heth, ETH_PacketTypeQueueConfigTypeDef *typequeueconf)
{
  uint32_t cmd;

  if (heth->gState != HAL_ETH_STATE_STARTED)
  {
    return HAL_ERROR;
  }

  if (typequeueconf == NULL)
  {
    return HAL_ERROR;
  }

  cmd = ETH_READ_OPERATION | ETH_MACIACR_OB | ((uint32_t)(typequeueconf->Address) << 8);

  /* Set command to MACIACR */
  MODIFY_REG(heth->Instance->MACIACR, ETH_MAC_IACR_MASK, cmd);

  /* Get tick */
  uint32_t tickstart = HAL_GetTick();

  /* wait until the Operation reset is done */
  while (READ_BIT(heth->Instance->MACIACR, ETH_MACIACR_OB) != (uint32_t)RESET)
  {
    if ((HAL_GetTick() - tickstart) > ETH_OP_BUSY_TIMEOUT)
    {
      /* Set Error Code */
      heth->MACErrorCode = HAL_ETH_ERROR_TIMEOUT;
      /* Set State as Error */
      heth->gState = HAL_ETH_STATE_ERROR;
      /* Return Error */
      return HAL_ERROR;
    }
  }

  /* Get configuration from MACTMRQR */
  typequeueconf->Preemption = READ_BIT(heth->Instance->MACTMRQR, ETH_MACTMRQR_PFEX_Msk);
  typequeueconf->Queue = (READ_BIT(heth->Instance->MACTMRQR, ETH_MACTMRQR_TMRQ_Msk) >> 16);
  typequeueconf->Type = READ_BIT(heth->Instance->MACTMRQR, ETH_MACTMRQR_TYP_Msk);

  /* Return function status */
  return HAL_OK;
}

#ifdef HAL_ETH_USE_CBS
/**
  * @brief  Enable the CBS Algorithm.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  queueIndex: contains the AV queue index which will support the CBS algorithm
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_EnableCBS(ETH_HandleTypeDef *heth, uint8_t queueIndex)
{
  /* Enable AV mode for Queue x */
  MODIFY_REG(heth->Instance->MTL_QUEUE[queueIndex].MTLTXQOMR, ETH_MTLTXQxOMR_TXQEN_Msk, ETH_TX_QUEUE_AV_ENABLED);

  /* Enable CBS Algorithm for Queue x */
  SET_BIT(heth->Instance->MTL_QUEUE[queueIndex].MTLTXQ1ECR, ETH_TX_QUEUE_AV_ALGO_CBS);

  /* Return function status */
  return HAL_OK;
}

static void ETHEx_SetCBSConfig(ETH_HandleTypeDef *heth, ETH_CBSConfigTypeDef *cbsconf)
{
  uint32_t cbsregval;
  cbsregval = (uint32_t)(cbsconf->SlotCount | cbsconf->CreditControl);
  /* Write to MTLTXQ1ECR */
  MODIFY_REG(heth->Instance->MTL_QUEUE[cbsconf->QueueIdx].MTLTXQ1ECR, ETH_MTLTXQ1ECR_SLC_Msk | ETH_MTLTXQ1ECR_CC_Msk,
             cbsregval);

  cbsregval = (uint32_t)cbsconf->IdleSlope;
  /* Write to MTLTXQ1QWR */
  MODIFY_REG(heth->Instance->MTL_QUEUE[cbsconf->QueueIdx].MTLTXQQWR, ETH_MTLTXQ1QWR_ISCQW_Msk, cbsregval);

  cbsregval = (uint32_t)cbsconf->SendSlope;
  /* Write to MTLTXQ1SSCR */
  MODIFY_REG(heth->Instance->MTL_QUEUE[cbsconf->QueueIdx].MTLTXQ1SSCR, ETH_MTLTXQ1SSCR_SSC_Msk, cbsregval);

  cbsregval = (uint32_t)cbsconf->HiCredit;
  /* Write to MTLTXQ1HCR */
  MODIFY_REG(heth->Instance->MTL_QUEUE[cbsconf->QueueIdx].MTLTXQ1HCR, ETH_MTLTXQ1HCR_HC_Msk, cbsregval);

  cbsregval = (uint32_t)cbsconf->LoCredit;
  /* Write to MTLTXQ1LCR */
  MODIFY_REG(heth->Instance->MTL_QUEUE[cbsconf->QueueIdx].MTLTXQ1LCR, ETH_MTLTXQ1LCR_LC_Msk, cbsregval);
}

/**
  * @brief  Set the CBS configuration.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  cbsconf: pointer to a ETH_CBSConfigTypeDef structure that contains
  *         the configuration of the CBS algorithm.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_SetCBSConfig(ETH_HandleTypeDef *heth,  ETH_CBSConfigTypeDef *cbsconf)
{
  if (cbsconf == NULL)
  {
    return HAL_ERROR;
  }

  if ((READ_BIT(heth->Instance->MTL_QUEUE[cbsconf->QueueIdx].MTLTXQOMR, ETH_TX_QUEUE_AV_ENABLED) != (uint32_t)RESET) &&
      (READ_BIT(heth->Instance->MTL_QUEUE[cbsconf->QueueIdx].MTLTXQ1ECR, ETH_TX_QUEUE_AV_ALGO_CBS) != (uint32_t)RESET))
  {
    ETHEx_SetCBSConfig(heth, cbsconf);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  HAL ETH Get CBS Config.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  pCBSConfig: pointer to a ETH_CBSConfigTypeDef structure that will hold
  *         the configuration of the CBS Algorithm.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_GetCBSConfig(const ETH_HandleTypeDef *heth, ETH_CBSConfigTypeDef *pCBSConfig,
                                         uint8_t queueIndex)
{
  if (pCBSConfig == NULL)
  {
    return HAL_ERROR;
  }

  pCBSConfig->QueueIdx = queueIndex;
  pCBSConfig->SlotCount = READ_BIT(heth->Instance->MTL_QUEUE[queueIndex].MTLTXQ1ECR, ETH_MTLTXQ1ECR_SLC);
  pCBSConfig->CreditControl = READ_BIT(heth->Instance->MTL_QUEUE[queueIndex].MTLTXQ1ECR, ETH_MTLTXQ1ECR_CC);
  pCBSConfig->IdleSlope = READ_BIT(heth->Instance->MTL_QUEUE[queueIndex].MTLTXQQWR, ETH_MTLTXQ1QWR_ISCQW);
  pCBSConfig->SendSlope = READ_BIT(heth->Instance->MTL_QUEUE[queueIndex].MTLTXQ1SSCR, ETH_MTLTXQ1SSCR_SSC);
  pCBSConfig->HiCredit = READ_BIT(heth->Instance->MTL_QUEUE[queueIndex].MTLTXQ1HCR, ETH_MTLTXQ1HCR_HC);
  pCBSConfig->LoCredit = READ_BIT(heth->Instance->MTL_QUEUE[queueIndex].MTLTXQ1LCR, ETH_MTLTXQ1LCR_LC);

  return HAL_OK;
}
#endif /* HAL_ETH_USE_CBS */

