micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_eth_ex.c
#ifdef HAL_ETH_USE_TAS
/**
  * @brief  HAL ETH Enable EST feature.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_EnableEST(ETH_HandleTypeDef *heth)
{
  if (heth->gState == HAL_ETH_STATE_STARTED)
  {
    /* Enable Enhancement Scheduling Transmission */
    SET_BIT(heth->Instance->MTLESTCR, ETH_MTLESTCR_EEST);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  HAL ETH Disable EST feature.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_DisableEST(ETH_HandleTypeDef *heth)
{
  if (heth->gState == HAL_ETH_STATE_STARTED)
  {
    /* Disable Enhancement Scheduling Transmission */
    CLEAR_BIT(heth->Instance->MTLESTCR, ETH_MTLESTCR_EEST);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  HAL ETH Get the HW Depth of the Gate Control List.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval Depth of the Gate Control List
  */
uint32_t HAL_ETHEx_GetGCLDepth(const ETH_HandleTypeDef *heth)
{
  uint32_t gcldepth;

  /* get HW GCL depth from HW configuration */
  gcldepth = READ_BIT(heth->Instance->MACHWF3R, ETH_MACHWF3R_ESTDEP_Msk);

  switch (gcldepth)
  {
    case ETH_MACHWF3R_ESTDEP_64 :
      return 64;
    case ETH_MACHWF3R_ESTDEP_128 :
      return 128;
    case ETH_MACHWF3R_ESTDEP_256 :
      return 256;
    case ETH_MACHWF3R_ESTDEP_512 :
      return 512;
    case ETH_MACHWF3R_ESTDEP_1024 :
      return 1024;
    default :
      return 0;
  }
}

/**
  * @brief  HAL ETH Get the HW Width of the Time Interval field in the Gate Control List
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval Width of the Time Interval field in the Gate Control List
  */
uint32_t HAL_ETHEx_GetGCLWidthTimeInterval(const ETH_HandleTypeDef *heth)
{
  uint32_t gclwidth;

  /* get HW GCL Width from HW configuration */
  gclwidth = READ_BIT(heth->Instance->MACHWF3R, ETH_MACHWF3R_ESTWID_Msk);

  switch (gclwidth)
  {
    case ETH_MACHWF3R_ESTWID_16 :
      return 16;
    case ETH_MACHWF3R_ESTWID_20 :
      return 20;
    case ETH_MACHWF3R_ESTWID_24 :
      return 24;
    default :
      return 0;
  }
}

/**
  * @brief  HAL ETH Check HW Completion Check
  */
static HAL_StatusTypeDef ETHEx_ESTHWCompletionCheck(ETH_HandleTypeDef *heth)
{
  /* Get tick */
  uint32_t tickstart = HAL_GetTick();

  /* wait until the reset is done by Hardware */
  while (READ_BIT(heth->Instance->MTLESTGCLCR, ETH_MTLESTGCLCR_SRWO) != (uint32_t)RESET)
  {
    if ((HAL_GetTick() - tickstart) > ETH_HWRESET_TIMEOUT)
    {
      /* Set State as Error */
      heth->gState = HAL_ETH_STATE_ERROR;
      /* Return Error */
      return HAL_ERROR;
    }
  }
  return HAL_OK;
}

/**
  * @brief  HAL ETH Get GCL Registers values
  */
HAL_StatusTypeDef HAL_ETHEx_GetGCLRegisters(ETH_HandleTypeDef *heth, ETH_GCLConfigTypeDef *gclconf)
{
  uint32_t mtlestgclctrl = ETH_MTLESTGCLCR_GCRR | ETH_MTLESTGCLCR_SRWO | ETH_MTLESTGCLCR_R1W0;
  uint32_t mtlestgclctrl_mask = ETH_MTLESTGCLCR_ADDR_Msk | ETH_MTLESTGCLCR_GCRR_Msk | ETH_MTLESTGCLCR_SRWO_Msk;

  /* Set BTR Low Address and start read operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_BTRLOW);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Get BTR Low value */
  gclconf->BaseTimeRegister = (uint32_t)READ_REG(heth->Instance->MTLESTGCLDR);

  /* Set BTR High Address and start read operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_BTRHIGH);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Get BTR High value */
  gclconf->BaseTimeRegister |= ((uint64_t)READ_REG(heth->Instance->MTLESTGCLDR) << 32U);

  /* Set CTR Low Address and start read operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_CTRLOW);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Get CTR Low value */
  gclconf->CycleTimeRegister = (uint32_t)READ_REG(heth->Instance->MTLESTGCLDR);

  /* Set CTR High Address and start read operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_CTRHIGH);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Get CTR High value */
  gclconf->CycleTimeRegister |= ((uint64_t)READ_REG(heth->Instance->MTLESTGCLDR) << 32U);

  /* Set TER Address and start read operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_TER);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Get TER value */
  gclconf->TimeExtensionRegister = (uint32_t)READ_REG(heth->Instance->MTLESTGCLDR);

  /* Set LLR Address and start read operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_LLR);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Get TER value */
  gclconf->ListLengthRegister = (uint32_t)READ_REG(heth->Instance->MTLESTGCLDR);

  return HAL_OK;
}

/**
  * @brief  HAL ETH Set GCL Registers values
  */
HAL_StatusTypeDef HAL_ETHEx_SetGCLRegisters(ETH_HandleTypeDef *heth, const ETH_GCLConfigTypeDef *gclconf)
{
  uint32_t mtlestgclctrl = ETH_MTLESTGCLCR_GCRR | ETH_MTLESTGCLCR_SRWO;
  uint32_t mtlestgclctrl_mask = ETH_MTLESTGCLCR_ADDR_Msk | ETH_MTLESTGCLCR_GCRR_Msk | ETH_MTLESTGCLCR_SRWO_Msk;

