micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_eth_ex.c
  /* Set BTR Low value */
  WRITE_REG(heth->Instance->MTLESTGCLDR, (uint32_t)gclconf->BaseTimeRegister);

  /* Set BTR Low Address and start write operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_BTRLOW);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set BTR High value */
  WRITE_REG(heth->Instance->MTLESTGCLDR, ((uint32_t)(gclconf->BaseTimeRegister >> 32)));

  /* Set BTR High Address and start write operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_BTRHIGH);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set CTR Low value */
  WRITE_REG(heth->Instance->MTLESTGCLDR, (uint32_t)gclconf->CycleTimeRegister);

  /* Set CTR Low Address and start write operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_CTRLOW);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set CTR High value */
  WRITE_REG(heth->Instance->MTLESTGCLDR, ((uint32_t)(gclconf->CycleTimeRegister >> 32)));

  /* Set CTR High Address and start write operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_CTRHIGH);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set TER value */
  WRITE_REG(heth->Instance->MTLESTGCLDR, (uint32_t)gclconf->TimeExtensionRegister);

  /* Set TER Address and start write operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_TER);

  /* Set LLR value */
  WRITE_REG(heth->Instance->MTLESTGCLDR, (uint32_t)gclconf->ListLengthRegister);

  /* Set LLR Address and start write operation */
  MODIFY_REG(heth->Instance->MTLESTGCLCR, mtlestgclctrl_mask, mtlestgclctrl | ETH_MTLESTGCLCR_ADDR_LLR);

  /* wait for a HW reset Check */
  if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  HAL ETH Set GCL configuration
  */
HAL_StatusTypeDef HAL_ETHEx_SetGCLConfig(ETH_HandleTypeDef *heth, ETH_GCLConfigTypeDef *gclconf)
{
  uint32_t glcidx;
  uint32_t data;

  for (glcidx = 0; glcidx < gclconf->ListLengthRegister; glcidx++)
  {
    /* Set data : TC1 + TC0 + TimeInterval */
    data = gclconf->opList->Interval | (gclconf->opList->Gate << ETH_EST_WID_MAX);

    /* Set data to MTLESTGCLDR register */
    WRITE_REG(heth->Instance->MTLESTGCLDR, data);

    /* Set Address and start write operation */
    MODIFY_REG(heth->Instance->MTLESTGCLCR, ETH_MTLESTGCLCR_ADDR_Msk | ETH_MTLESTGCLCR_SRWO_Msk,
               (glcidx << ETH_MTLESTGCLCR_ADDR_Pos) | ETH_MTLESTGCLCR_SRWO);

    /* wait for a HW completion Check */
    if (ETHEx_ESTHWCompletionCheck(heth) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* If ok, Move to the next GLC in the list */
    (gclconf->opList)++;
  }

  if (HAL_ETHEx_SetGCLRegisters(heth, gclconf) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  HAL ETH Set Enhancement Scheduling Traffic Configuration
  */
static HAL_StatusTypeDef ETHEx_SetESTConfig(ETH_HandleTypeDef *heth, ETH_ESTConfigTypeDef *estconf)
{
  uint32_t estregval;

  /* Check on GCL list Length */
  if (estconf->GCLRegisters.ListLengthRegister > ETH_EST_DEP_MAX)
  {
    return HAL_ERROR;
  }
  /* Check on opList */
  if (estconf->GCLRegisters.opList == NULL)
  {
    return HAL_ERROR;
  }
  /* Check on completion of switch to the S/W owned list */
  if (READ_BIT(heth->Instance->MTLESTCR, ETH_MTLESTCR_SSWL) != (uint32_t)RESET)
  {
    return HAL_ERROR;
  }

  /* Programming the GCL and GCL-linked registers */
  if (HAL_ETHEx_SetGCLConfig(heth, &estconf->GCLRegisters) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set EST Configuration */
  estregval = ((estconf->SwitchToSWOL << 1) |
               ((uint32_t)estconf->NotDropFramesDuringFrameSizeError << 4) |
               ((uint32_t)estconf->DropFramesCausingError << 5) |
               (estconf->LoopCountSchedulingError) |
               (estconf->TimeIntervalLeftShift << 8) |
               (estconf->CurrentTimeOffset << 12) |
               (((uint32_t)(1000000000U / estconf->PTPTimeOffset) * 6U) << 24));

  /* Write to MTLESTCR */
  MODIFY_REG(heth->Instance->MTLESTCR, ETH_MTLESTCR_MASK, estregval);

  /* Get Overhead bytes value */
  estregval = estconf->OverheadBytesValue;

  /* Write to MTLESTECR */
  MODIFY_REG(heth->Instance->MTLESTECR, ETH_MTLESTECR_OVHD_Msk, estregval);

  /* Enable Enhancement Scheduling Traffic feature */
  if (HAL_ETHEx_EnableEST(heth) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Set the EST configuration.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  estconf: pointer to a ETH_ESTConfigTypeDef structure that contains
  *         the configuration of the EST algorithm.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_SetESTConfig(ETH_HandleTypeDef *heth,  ETH_ESTConfigTypeDef *estconf)
{
  if (estconf == NULL)
  {
    return HAL_ERROR;
  }

  if (heth->gState == HAL_ETH_STATE_STARTED)
  {
    if (ETHEx_SetESTConfig(heth, estconf) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* HAL_ETH_USE_TAS */

#ifdef HAL_ETH_USE_FPE
/**
  * @brief  Enable FPE feature.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_EnableFPE(ETH_HandleTypeDef *heth)
{
  if (heth->gState == HAL_ETH_STATE_STARTED)
  {
    /* Enable Tx Frame Preemption feature */
    SET_BIT(heth->Instance->MACFPECSR, ETH_MACFPECSR_EFPE);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Disable FPE feature.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_DisableFPE(ETH_HandleTypeDef *heth)
{
  if (heth->gState == HAL_ETH_STATE_STARTED)
  {
    /* Disable Tx Frame Preemption feature */
    CLEAR_BIT(heth->Instance->MACFPECSR, ETH_MACFPECSR_EFPE);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Get the FPE configuration.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  fpeconf: pointer to a ETH_FPEConfigTypeDef structure that contains
  *         the configuration of the FPE Feature.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_GetFPEConfig(ETH_HandleTypeDef *heth,  ETH_FPEConfigTypeDef *fpeconf)
{
  if (fpeconf == NULL)
  {
    return HAL_ERROR;
  }

  fpeconf->AdditionalFragmentSize = READ_BIT(heth->Instance->MTLFPECSR, ETH_MTLFPECSR_AFSZ);
  fpeconf->PreemptionClassification = READ_BIT(heth->Instance->MTLFPECSR, ETH_MTLFPECSR_PEC);
  fpeconf->HoldReleaseStatus = READ_BIT(heth->Instance->MTLFPECSR, ETH_MTLFPECSR_HRS);

  fpeconf->HoldAdvance = READ_BIT(heth->Instance->MTLFPEAR, ETH_MTLFPEAR_HADV);
  fpeconf->ReleaseAdvance = READ_BIT(heth->Instance->MTLFPEAR, ETH_MTLFPEAR_RADV);

