micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_eth_ex.c
  fpeconf->SendVerifymPacket = ((READ_BIT(heth->Instance->MACFPECSR,
                                          ETH_MACFPECSR_SVER) >> ETH_MACFPECSR_SVER_Pos) > 0U) ? ENABLE : DISABLE;
  fpeconf->SendRespondmPacket = ((READ_BIT(heth->Instance->MACFPECSR,
                                           ETH_MACFPECSR_SRSP) >> ETH_MACFPECSR_SRSP_Pos) > 0U) ? ENABLE : DISABLE;
  return HAL_OK;
}

static void ETHEx_SetFPEConfig(ETH_HandleTypeDef *heth, ETH_FPEConfigTypeDef *fpeconf)
{
  uint32_t fperegval;

  fperegval = fpeconf->PreemptionClassification | fpeconf->AdditionalFragmentSize;

  /* Write to MTLFPECSR */
  WRITE_REG(heth->Instance->MTLFPECSR, fperegval);

  fperegval = fpeconf->HoldAdvance | fpeconf->ReleaseAdvance;

  /* Write to MTLFPEAR */
  WRITE_REG(heth->Instance->MTLFPEAR, fperegval);

  fperegval = ((uint32_t)((fpeconf->SendVerifymPacket == ENABLE) ? 1U : 0U) << 1) |
              ((uint32_t)((fpeconf->SendRespondmPacket == ENABLE) ? 1U : 0U) << 2);

  /* Write to MACFPECSR */
  MODIFY_REG(heth->Instance->MACFPECSR, ETH_MACFPECSR_SVER_Msk | ETH_MACFPECSR_SRSP_Msk, fperegval);
}

/**
  * @brief  Set the FPE configuration.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  fpeconf: pointer to a ETH_FPEConfigTypeDef structure that contains
  *         the configuration of the FPE Feature.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETHEx_SetFPEConfig(ETH_HandleTypeDef *heth,  ETH_FPEConfigTypeDef *fpeconf)
{
  if (fpeconf == NULL)
  {
    return HAL_ERROR;
  }

  if (heth->gState == HAL_ETH_STATE_STARTED)
  {
    ETHEx_SetFPEConfig(heth, fpeconf);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* HAL_ETH_USE_FPE */
/**
  * @}
  */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* ETH1 */

#endif /* HAL_ETH_MODULE_ENABLED */
/**
  * @}
  */
